public_html/Books Review/The C Programming Language/Exercises(The C programming Language) .html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Exercises(The C programming Language)</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Exercises(The C programming Language)"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-08 12:37:11 HKT"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Exercises(The C programming Language)</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Chapter 1 - A Tutorial Introduction</a></li>
<li><a href="#sec-2">Chapter 2 - Types, Operators and Expressions</a></li>
<li><a href="#sec-3">Chapter 3 - Control Flow</a></li>
<li><a href="#sec-4">Chapter 4 - Functions and Program Structure</a></li>
<li><a href="#sec-5">Chapter 5 - Pointers and Arrays</a></li>
<li><a href="#sec-6">Chapter 6 - Structures</a></li>
<li><a href="#sec-7">Chapter 7 - Input and Output</a></li>
<li><a href="#sec-8">Chapter 8 - The UNIX System Interface</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Chapter 1 - A Tutorial Introduction</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li id="sec-1-1">Ex 1<br/>
Run the "hello world" program on your system. Experiment with leaving
out parts of the program, to see what error messages you get.

</li>
</ul>
<ul>
<li id="sec-1-2">Ex 2<br/>
Experiment to find out what happens when printf 's argument string
contains \c, where c is some character not listed above.

<p>
上面有的：
</p>


<pre class="src src-c">\n {newline}
\t {tab}
\b {backspace}
\<span style="color: #ffc0cb; font-weight: bold;">"</span> {<span style="color: #98fb98;">double</span> <span style="color: #eedd82;">quote</span>}
\\ {backslash}
</pre>


<p>
这里必须小心对待转义序列，如果用一个未定义的转义字符则引起<a href="http://clc-wiki.net/wiki/Undefined_behaviour">Undefined behaviour</a>.
</p>
</li>
</ul>
<ul>
<li id="sec-1-3">Ex 3<br/>
Modify the temperature conversion program to print a heading above the
table.

</li>
</ul>
<ul>
<li id="sec-1-4">Ex 4<br/>
Write a program to print the corresponding Celsius to Fahrenheit
table.

</li>
</ul>
<ul>
<li id="sec-1-5">Ex 5<br/>
Modify the temperature conversion program to print the table in
reverse order, that is, from 300 degrees to 0.

</li>
</ul>
<ul>
<li id="sec-1-6">Ex 6<br/>
Verify that the expression getchar() != EOF is 0 or 1.

</li>
</ul>
<ul>
<li id="sec-1-7">Ex 7<br/>
Write a program to print the value of EOF.

</li>
</ul>
<ul>
<li id="sec-1-8">Ex 8<br/>
Write a program to count blanks, tabs, and newlines.

</li>
</ul>
<ul>
<li id="sec-1-9">Ex 9<br/>
Write a program to copy its input to its output, replacing each string
of one or more blanks by a single blank. 

</li>
</ul>
<ul>
<li id="sec-1-10">Ex 10<br/>
Write a program to copy its input to its output, replacing each tab by
\t , each backspace by \b , and each backslash by \\ . This makes tabs
and backspaces visible in an unambiguous way.

</li>
</ul>
<ul>
<li id="sec-1-11">Ex 11<br/>
How would you test the word count program? What kinds of input are
most likely to uncover bugs if there are any? 

</li>
</ul>
<ul>
<li id="sec-1-12">Ex 12<br/>
Write a program that prints its input one word per line. 

</li>
</ul>
<ul>
<li id="sec-1-13">Ex 13<br/>
Write a program to print a histogram of the lengths of words in its
input. It is easy to draw the histogram with the bars horizontal; a
vertical orientation is more challenging. 

</li>
</ul>
<ul>
<li id="sec-1-14">Ex 14<br/>
Write a program to print a histogram of the frequencies of different
characters in its input.

</li>
</ul>
<ul>
<li id="sec-1-15">Ex 15<br/>
Rewrite the temperature conversion program of Section 1.2 to use a
function for conversion. 

</li>
</ul>
<ul>
<li id="sec-1-16">Ex 16<br/>
Revise the main routine of the longest-line program so it will
correctly print the length of arbitrarily long input lines, and as
much as possible of the text.

</li>
</ul>
<ul>
<li id="sec-1-17">Ex 17<br/>
Write a program to print all input lines that are longer than 80
characters. 

</li>
</ul>
<ul>
<li id="sec-1-18">Ex 18<br/>
Write a program to remove all trailing blanks and tabs from each line
of input, and to delete entirely blank lines. 

</li>
</ul>
<ul>
<li id="sec-1-19">Ex 19<br/>
Write a function reverse(s) that reverses the character string s . Use
it to write a program that reverses its input a line at a time. 

</li>
</ul>
<ul>
<li id="sec-1-20">Ex 20<br/>
Write a program detab that replaces tabs in the input with the proper
number of blanks to space to the next tab stop. Assume a fixed set of
tab stops, say every n columns. Should n be a variable or a symbolic
parameter? 

</li>
</ul>
<ul>
<li id="sec-1-21">Ex 21<br/>
Write a program entab that replaces strings of blanks with the minimum
number of tabs and blanks to achieve the same spacing. Use the same
stops as for detab . When either a tab or a single blank would suffice
to reach a tab stop, which should be given preference? 

</li>
</ul>
<ul>
<li id="sec-1-22">Ex 22<br/>
Write a program to "fold" long input lines into two or more shorter
lines after the last non-blank character that occurs before the n -th
column of input. Make sure your program does something intelligent
with very long lines, and if there are no blanks or tabs before the
specified column. 

</li>
</ul>
<ul>
<li id="sec-1-23">Ex 23<br/>
Write a program to remove all comments from a C program. Don't forget
to handle quoted strings and character constants properly. C comments
do not nest. 

</li>
</ul>
<ul>
<li id="sec-1-24">Ex 24<br/>
Write a program to check a C program for rudimentary syntax errors
like unbalanced parentheses, brackets and braces. Don't forget about
quotes, both single and double, escape sequences, and comments. (This
program is hard if you do it in full generality.) 





</li>
</ul>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Chapter 2 - Types, Operators and Expressions</h2>
<div class="outline-text-2" id="text-2">

<ul>
<li id="sec-2-1">a<br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Chapter 3 - Control Flow</h2>
<div class="outline-text-2" id="text-3">

<ul>
<li id="sec-3-1">a<br/>

</li>
</ul>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Chapter 4 - Functions and Program Structure</h2>
<div class="outline-text-2" id="text-4">


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Chapter 5 - Pointers and Arrays</h2>
<div class="outline-text-2" id="text-5">


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">Chapter 6 - Structures</h2>
<div class="outline-text-2" id="text-6">


</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">Chapter 7 - Input and Output</h2>
<div class="outline-text-2" id="text-7">


</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8">Chapter 8 - The UNIX System Interface</h2>
<div class="outline-text-2" id="text-8">

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-08-08 12:37:11 HKT</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator">Org version 7.8.09 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
